garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F06Q41.PIC
        <edc:SFRDef edc:access="rr---nnn" edc:cname="SPI1CON2" edc:desc="" edc:impl="0xc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---000" edc:name="SPI1CON2" edc:nzwidth="8" edc:por="00---000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x86">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXR" edc:mask="0x1" edc:name="RXR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXR" edc:mask="0x1" edc:name="TXR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSET" edc:mask="0x1" edc:name="SSET" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="SSFLT" edc:mask="0x1" edc:name="SSFLT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUSY" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI1RXR" edc:mask="0x1" edc:name="SPI1RXR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXR" edc:mask="0x1" edc:name="SPI1TXR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SSET" edc:mask="0x1" edc:name="SPI1SSET" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="SPI1SSFLT" edc:mask="0x1" edc:name="SPI1SSFLT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1BUSY" edc:mask="0x1" edc:name="SPI1BUSY" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="c-r-cs-r" edc:cname="SPI1STATUS" edc:desc="" edc:impl="0xad" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-1-00-0" edc:name="SPI1STATUS" edc:nzwidth="8" edc:por="0-1-00-0" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x87">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXBF" edc:mask="0x1" edc:name="RXBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CLRBF" edc:mask="0x1" edc:name="CLRBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRE" edc:mask="0x1" edc:name="RXRE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBE" edc:mask="0x1" edc:name="TXBE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWE" edc:mask="0x1" edc:name="TXWE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI1RXBF" edc:mask="0x1" edc:name="SPI1RXBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1CLRBF" edc:mask="0x1" edc:name="SPI1CLRBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1RXRE" edc:mask="0x1" edc:name="SPI1RXRE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXBE" edc:mask="0x1" edc:name="SPI1TXBE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXWE" edc:mask="0x1" edc:name="SPI1TXWE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="SPI1TWIDTH" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="SPI1TWIDTH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x88">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TWIDTH" edc:mask="0x7" edc:name="TWIDTH" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TWIDTH0" edc:mask="0x1" edc:name="TWIDTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWIDTH1" edc:mask="0x1" edc:name="TWIDTH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWIDTH2" edc:mask="0x1" edc:name="TWIDTH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPI1BAUD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPI1BAUD" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x89">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BAUD" edc:mask="0xff" edc:name="BAUD" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BAUD0" edc:mask="0x1" edc:name="BAUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD1" edc:mask="0x1" edc:name="BAUD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD2" edc:mask="0x1" edc:name="BAUD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD3" edc:mask="0x1" edc:name="BAUD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD4" edc:mask="0x1" edc:name="BAUD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD5" edc:mask="0x1" edc:name="BAUD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD6" edc:mask="0x1" edc:name="BAUD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD7" edc:mask="0x1" edc:name="BAUD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nn-" edc:cname="SPI1INTF" edc:desc="" edc:impl="0xf6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-00-" edc:name="SPI1INTF" edc:nzwidth="8" edc:por="0000-00-" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x8A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXUIF" edc:mask="0x1" edc:name="TXUIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOIF" edc:mask="0x1" edc:name="RXOIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EOSIF" edc:mask="0x1" edc:name="EOSIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOSIF" edc:mask="0x1" edc:name="SOSIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCZIF" edc:mask="0x1" edc:name="TCZIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRMTIF" edc:mask="0x1" edc:name="SRMTIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXUIF" edc:mask="0x1" edc:name="SPI1TXUIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1RXOIF" edc:mask="0x1" edc:name="SPI1RXOIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1EOSIF" edc:mask="0x1" edc:name="SPI1EOSIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SOSIF" edc:mask="0x1" edc:name="SPI1SOSIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TCZIF" edc:mask="0x1" edc:name="SPI1TCZIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SRMTIF" edc:mask="0x1" edc:name="SPI1SRMTIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nn-" edc:cname="SPI1INTE" edc:desc="" edc:impl="0xf6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-00-" edc:name="SPI1INTE" edc:nzwidth="8" edc:por="0000-00-" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x8B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXUIE" edc:mask="0x1" edc:name="TXUIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOIE" edc:mask="0x1" edc:name="RXOIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EOSIE" edc:mask="0x1" edc:name="EOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOSIE" edc:mask="0x1" edc:name="SOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCZIE" edc:mask="0x1" edc:name="TCZIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRMTIE" edc:mask="0x1" edc:name="SRMTIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXUIE" edc:mask="0x1" edc:name="SPI1TXUIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1RXOIE" edc:mask="0x1" edc:name="SPI1RXOIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1EOSIE" edc:mask="0x1" edc:name="SPI1EOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SOSIE" edc:mask="0x1" edc:name="SPI1SOSIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TCZIE" edc:mask="0x1" edc:name="SPI1TCZIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1SRMTIE" edc:mask="0x1" edc:name="SPI1SRMTIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="SPI1CLK" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="SPI1CLK" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x8C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLKSEL" edc:mask="0xf" edc:name="CLKSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLKSEL0" edc:mask="0x1" edc:name="CLKSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL1" edc:mask="0x1" edc:name="CLKSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL2" edc:mask="0x1" edc:name="CLKSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLKSEL3" edc:mask="0x1" edc:name="CLKSEL3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SPI1CLKSEL" edc:mask="0xf" edc:name="SPI1CLKSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="SPI1CLKSEL0" edc:mask="0x1" edc:name="SPI1CLKSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1CLKSEL1" edc:mask="0x1" edc:name="SPI1CLKSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1CLKSEL2" edc:mask="0x1" edc:name="SPI1CLKSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1CLKSEL3" edc:mask="0x1" edc:name="SPI1CLKSEL3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="SPI2RXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SPI2RXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x8D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB" edc:mask="0xff" edc:name="RXB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RXB0" edc:mask="0x1" edc:name="RXB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1" edc:mask="0x1" edc:name="RXB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB2" edc:mask="0x1" edc:name="RXB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB3" edc:mask="0x1" edc:name="RXB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB4" edc:mask="0x1" edc:name="RXB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB5" edc:mask="0x1" edc:name="RXB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB6" edc:mask="0x1" edc:name="RXB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB7" edc:mask="0x1" edc:name="RXB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="SPI2TXB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="SPI2TXB" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x8E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB" edc:mask="0xff" edc:name="TXB" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TXB0" edc:mask="0x1" edc:name="TXB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1" edc:mask="0x1" edc:name="TXB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2" edc:mask="0x1" edc:name="TXB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB3" edc:mask="0x1" edc:name="TXB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB4" edc:mask="0x1" edc:name="TXB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB5" edc:mask="0x1" edc:name="TXB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB6" edc:mask="0x1" edc:name="TXB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB7" edc:mask="0x1" edc:name="TXB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
