garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/edc/PIC18F06Q41.PIC
        <edc:JoinedSFRDef edc:cname="SPI2TCNT" edc:desc="" edc:name="SPI2TCNT" edc:nzwidth="0x10" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x8F">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPI2TCNTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPI2TCNTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x8F">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TCNTL" edc:mask="0xff" edc:name="TCNTL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="-----nnn" edc:cname="SPI2TCNTH" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="SPI2TCNTH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x90">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TCNTH" edc:mask="0x7" edc:name="TCNTH" edc:nzwidth="0x3"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n----nnn" edc:cname="SPI2CON0" edc:desc="" edc:impl="0x87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0----000" edc:name="SPI2CON0" edc:nzwidth="8" edc:por="0----000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x91">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BMODE" edc:mask="0x1" edc:name="BMODE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MST" edc:mask="0x1" edc:name="MST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LSBF" edc:mask="0x1" edc:name="LSBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI2BMODE" edc:mask="0x1" edc:name="SPI2BMODE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2MST" edc:mask="0x1" edc:name="SPI2MST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2LSBF" edc:mask="0x1" edc:name="SPI2LSBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x4"/>
              <edc:SFRFieldDef edc:cname="SPI2SPIEN" edc:mask="0x1" edc:name="SPI2SPIEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="SPI2CON1" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-100" edc:name="SPI2CON1" edc:nzwidth="8" edc:por="0000-100" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x92">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SDOP" edc:mask="0x1" edc:name="SDOP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SDIP" edc:mask="0x1" edc:name="SDIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSP" edc:mask="0x1" edc:name="SSP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FST" edc:mask="0x1" edc:name="FST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKP" edc:mask="0x1" edc:name="CKP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKE" edc:mask="0x1" edc:name="CKE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SMP" edc:mask="0x1" edc:name="SMP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI2SDOP" edc:mask="0x1" edc:name="SPI2SDOP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SDIP" edc:mask="0x1" edc:name="SPI2SDIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SSP" edc:mask="0x1" edc:name="SPI2SSP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2FST" edc:mask="0x1" edc:name="SPI2FST" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2CKP" edc:mask="0x1" edc:name="SPI2CKP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2CKE" edc:mask="0x1" edc:name="SPI2CKE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SMP" edc:mask="0x1" edc:name="SPI2SMP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rr---nnn" edc:cname="SPI2CON2" edc:desc="" edc:impl="0xc7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---000" edc:name="SPI2CON2" edc:nzwidth="8" edc:por="00---000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x93">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXR" edc:mask="0x1" edc:name="RXR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXR" edc:mask="0x1" edc:name="TXR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SSET" edc:mask="0x1" edc:name="SSET" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="SSFLT" edc:mask="0x1" edc:name="SSFLT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BUSY" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI2RXR" edc:mask="0x1" edc:name="SPI2RXR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TXR" edc:mask="0x1" edc:name="SPI2TXR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SSET" edc:mask="0x1" edc:name="SPI2SSET" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="SPI2SSFLT" edc:mask="0x1" edc:name="SPI2SSFLT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2BUSY" edc:mask="0x1" edc:name="SPI2BUSY" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="c-r-cs-r" edc:cname="SPI2STATUS" edc:desc="" edc:impl="0xad" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-1-00-0" edc:name="SPI2STATUS" edc:nzwidth="8" edc:por="0-1-00-0" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x94">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXBF" edc:mask="0x1" edc:name="RXBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CLRBF" edc:mask="0x1" edc:name="CLRBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRE" edc:mask="0x1" edc:name="RXRE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBE" edc:mask="0x1" edc:name="TXBE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWE" edc:mask="0x1" edc:name="TXWE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SPI2RXBF" edc:mask="0x1" edc:name="SPI2RXBF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2CLRBF" edc:mask="0x1" edc:name="SPI2CLRBF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2RXRE" edc:mask="0x1" edc:name="SPI2RXRE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TXBE" edc:mask="0x1" edc:name="SPI2TXBE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TXWE" edc:mask="0x1" edc:name="SPI2TXWE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="SPI2TWIDTH" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="SPI2TWIDTH" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x95">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TWIDTH" edc:mask="0x7" edc:name="TWIDTH" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TWIDTH0" edc:mask="0x1" edc:name="TWIDTH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWIDTH1" edc:mask="0x1" edc:name="TWIDTH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TWIDTH2" edc:mask="0x1" edc:name="TWIDTH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SPI2BAUD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SPI2BAUD" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x96">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BAUD" edc:mask="0xff" edc:name="BAUD" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BAUD0" edc:mask="0x1" edc:name="BAUD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD1" edc:mask="0x1" edc:name="BAUD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD2" edc:mask="0x1" edc:name="BAUD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD3" edc:mask="0x1" edc:name="BAUD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD4" edc:mask="0x1" edc:name="BAUD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD5" edc:mask="0x1" edc:name="BAUD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD6" edc:mask="0x1" edc:name="BAUD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BAUD7" edc:mask="0x1" edc:name="BAUD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nn-" edc:cname="SPI2INTF" edc:desc="" edc:impl="0xf6" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-00-" edc:name="SPI2INTF" edc:nzwidth="8" edc:por="0000-00-" edc:_modsrc="DOS-02941_spi_8bit_v1.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xd" edc:_addr="0x97">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXUIF" edc:mask="0x1" edc:name="TXUIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXOIF" edc:mask="0x1" edc:name="RXOIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="EOSIF" edc:mask="0x1" edc:name="EOSIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SOSIF" edc:mask="0x1" edc:name="SOSIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TCZIF" edc:mask="0x1" edc:name="TCZIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRMTIF" edc:mask="0x1" edc:name="SRMTIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TXUIF" edc:mask="0x1" edc:name="SPI2TXUIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2RXOIF" edc:mask="0x1" edc:name="SPI2RXOIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2EOSIF" edc:mask="0x1" edc:name="SPI2EOSIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SOSIF" edc:mask="0x1" edc:name="SPI2SOSIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2TCZIF" edc:mask="0x1" edc:name="SPI2TCZIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI2SRMTIF" edc:mask="0x1" edc:name="SPI2SRMTIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
